Revit 2026 API

# AccessLevel Enumeration

---

Defines access levels to objects in the Extensible Storage framework.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AccessLevel
```
```vb
Public Enumeration AccessLevel
```
```cpp
public enum class AccessLevel
```
```fsharp
type AccessLevel
```

| Member name | Value | Description |
| --- | --- | --- |
| Application | 3 | Only application that created the object has access to it. |
| Public | 1 | Anybody has access to the object. |
| Vendor | 2 | Only object vendor has access to it. |

#### Reference

Autodesk.Revit.DB.ExtensibleStorage Namespace